import csv
from .models import Stock
from .forms import CSVUploadForm
from django.contrib import messages
from django.core.exceptions import FieldError
from django.shortcuts import redirect, render
def stock_list(request):
    stocks = Stock.objects.filter(EV_EBITDA=10)
    return render(request, 'stocks/stock_list.html', {'stocks': stocks})

def index(request):
    stocks = Stock.objects.all()
    return render(request, 'stocks/index.html', {'stocks': stocks})

def load_data(request):
    # Logic to load data
    return redirect('index')

def apply_filter(request):
    # Logic to apply filter
    return redirect('index')


def upload_csv(request):
    if request.method == 'POST':
        forms = CSVUploadForm(request.POST, request.FILES)
        if forms.is_valid():
            csv_file = request.FILES['csv_file']
            try:
                reader = csv.reader(csv_file.read().decode('utf-8').splitlines())
                header = next(reader)  # Read the header row
                print(f"header is {header[278]}")
            except StopIteration:
                return render(request, 'stocks/upload_csv.html', {
                    'form': forms,
                    'error': 'The CSV file is empty or not correctly formatted.',
                })
            except Exception as e:
                return render(request, 'stocks/upload_csv.html', {
                    'form': forms,
                    'error': f'Error reading CSV file: {e}',
                })
            expected_fields = ['Symbol', 'Paid-up(ล้านบาท)', 'MarketCap(ล้านบาท)', 'EV(ล้านบาท)', 'EBITDA(ล้านบาท)', 'EV/EBITDA', 'Price(บาท)', 'P/E(X)', 'P/BV(X)', 'เงินสดและรายการเทียบเท่าเงินสด งบปี 2564', 'เงินสดและรายการเทียบเท่าเงินสด งบปี 2565', 'เงินสดและรายการเทียบเท่าเงินสด งบปี 2566', 'เงินสดและรายการเทียบเท่าเงินสด ไตรมาส 1/2566', 'เงินสดและรายการเทียบเท่าเงินสด ไตรมาส 1/2567', 'ลูกหนี้และตั๋วเงินรับการค้าสุทธิ งบปี 2564', 'ลูกหนี้และตั๋วเงินรับการค้าสุทธิ งบปี 2565', 'ลูกหนี้และตั๋วเงินรับการค้าสุทธิ งบปี 2566', 'ลูกหนี้และตั๋วเงินรับการค้าสุทธิ ไตรมาส 1/2566', 'ลูกหนี้และตั๋วเงินรับการค้าสุทธิ ไตรมาส 1/2567', 'สินค้าคงเหลือ งบปี 2564', 'สินค้าคงเหลือ งบปี 2565', 'สินค้าคงเหลือ งบปี 2566', 'สินค้าคงเหลือ ไตรมาส 1/2566', 'สินค้าคงเหลือ ไตรมาส 1/2567', 'รวมสินทรัพย์หมุนเวียน งบปี 2564', 'รวมสินทรัพย์หมุนเวียน งบปี 2565', 'รวมสินทรัพย์หมุนเวียน งบปี 2566', 'รวมสินทรัพย์หมุนเวียน ไตรมาส 1/2566', 'รวมสินทรัพย์หมุนเวียน ไตรมาส 1/2567', 'ที่ดินอาคารและอุปกรณ์สุทธิ งบปี 2564', 'ที่ดินอาคารและอุปกรณ์สุทธิ งบปี 2565', 'ที่ดินอาคารและอุปกรณ์สุทธิ งบปี 2566', 'ที่ดินอาคารและอุปกรณ์สุทธิ ไตรมาส 1/2566', 'ที่ดินอาคารและอุปกรณ์สุทธิ ไตรมาส 1/2567', 'รวมสินทรัพย์ไม่หมุนเวียน งบปี 2564', 'รวมสินทรัพย์ไม่หมุนเวียน งบปี 2565', 'รวมสินทรัพย์ไม่หมุนเวียน งบปี 2566', 'รวมสินทรัพย์ไม่หมุนเวียน ไตรมาส 1/2566', 'รวมสินทรัพย์ไม่หมุนเวียน ไตรมาส 1/2567', 'รวมสินทรัพย์ งบปี 2564', 'รวมสินทรัพย์ งบปี 2565', 'รวมสินทรัพย์ งบปี 2566', 'รวมสินทรัพย์ ไตรมาส 1/2566', 'รวมสินทรัพย์ ไตรมาส 1/2567', 'เงินเบิกเกินบัญชีและเงินกู้ยืม งบปี 2564', 'เงินเบิกเกินบัญชีและเงินกู้ยืม งบปี 2565', 'เงินเบิกเกินบัญชีและเงินกู้ยืม งบปี 2566', 'เงินเบิกเกินบัญชีและเงินกู้ยืม ไตรมาส 1/2566', 'เงินเบิกเกินบัญชีและเงินกู้ยืม ไตรมาส 1/2567', 'เจ้าหนี้และตั๋วเงินจ่ายการค้าสุทธิ งบปี 2564', 'เจ้าหนี้และตั๋วเงินจ่ายการค้าสุทธิ งบปี 2565', 'เจ้าหนี้และตั๋วเงินจ่ายการค้าสุทธิ งบปี 2566', 'เจ้าหนี้และตั๋วเงินจ่ายการค้าสุทธิ ไตรมาส 1/2566', 'เจ้าหนี้และตั๋วเงินจ่ายการค้าสุทธิ ไตรมาส 1/2567', 'หนี้สินระยะยาวที่ถึงกำหนดชำระภายในหนึ่งปี งบปี 2564', 'หนี้สินระยะยาวที่ถึงกำหนดชำระภายในหนึ่งปี งบปี 2565', 'หนี้สินระยะยาวที่ถึงกำหนดชำระภายในหนึ่งปี งบปี 2566', 'หนี้สินระยะยาวที่ถึงกำหนดชำระภายในหนึ่งปี ไตรมาส 1/2566', 'หนี้สินระยะยาวที่ถึงกำหนดชำระภายในหนึ่งปี ไตรมาส 1/2567', 'รวมหนี้สินหมุนเวียน งบปี 2564', 'รวมหนี้สินหมุนเวียน งบปี 2565', 'รวมหนี้สินหมุนเวียน งบปี 2566', 'รวมหนี้สินหมุนเวียน ไตรมาส 1/2566', 'รวมหนี้สินหมุนเวียน ไตรมาส 1/2567', 'รวมหนี้สินไม่หมุนเวียน งบปี 2564', 'รวมหนี้สินไม่หมุนเวียน งบปี 2565', 'รวมหนี้สินไม่หมุนเวียน งบปี 2566', 'รวมหนี้สินไม่หมุนเวียน ไตรมาส 1/2566', 'รวมหนี้สินไม่หมุนเวียน ไตรมาส 1/2567', 'รวมหนี้สิน งบปี 2564', 'รวมหนี้สิน งบปี 2565', 'รวมหนี้สิน งบปี 2566', 'รวมหนี้สิน ไตรมาส 1/2566', 'รวมหนี้สิน ไตรมาส 1/2567', 'ทุนจดทะเบียน งบปี 2564', 'ทุนจดทะเบียน งบปี 2565', 'ทุนจดทะเบียน งบปี 2566', 'ทุนจดทะเบียน ไตรมาส 1/2566', 'ทุนจดทะเบียน ไตรมาส 1/2567', 'ทุนที่ออกและชำระเต็มมูลค่า งบปี 2564', 'ทุนที่ออกและชำระเต็มมูลค่า งบปี 2565', 'ทุนที่ออกและชำระเต็มมูลค่า งบปี 2566', 'ทุนที่ออกและชำระเต็มมูลค่า ไตรมาส 1/2566', 'ทุนที่ออกและชำระเต็มมูลค่า ไตรมาส 1/2567', 'ส่วนเกิน(ต่ำกว่า)มูลค่าหุ้น งบปี 2564', 'ส่วนเกิน(ต่ำกว่า)มูลค่าหุ้น งบปี 2565', 'ส่วนเกิน(ต่ำกว่า)มูลค่าหุ้น งบปี 2566', 'ส่วนเกิน(ต่ำกว่า)มูลค่าหุ้น ไตรมาส 1/2566', 'ส่วนเกิน(ต่ำกว่า)มูลค่าหุ้น ไตรมาส 1/2567', 'กำไร(ขาดทุน)สะสม งบปี 2564', 'กำไร(ขาดทุน)สะสม งบปี 2565', 'กำไร(ขาดทุน)สะสม งบปี 2566', 'กำไร(ขาดทุน)สะสม ไตรมาส 1/2566', 'กำไร(ขาดทุน)สะสม ไตรมาส 1/2567', 'หุ้นทุนรับซื้อคืน งบปี 2564', 'หุ้นทุนรับซื้อคืน งบปี 2565', 'หุ้นทุนรับซื้อคืน งบปี 2566', 'หุ้นทุนรับซื้อคืน ไตรมาส 1/2566', 'หุ้นทุนรับซื้อคืน ไตรมาส 1/2567', 'หุ้นที่ถือโดยบริษัทย่อย งบปี 2564', 'หุ้นที่ถือโดยบริษัทย่อย งบปี 2565', 'หุ้นที่ถือโดยบริษัทย่อย งบปี 2566', 'หุ้นที่ถือโดยบริษัทย่อย ไตรมาส 1/2566', 'หุ้นที่ถือโดยบริษัทย่อย ไตรมาส 1/2567', 'องค์ประกอบอื่นของส่วนของผู้ถือหุ้น งบปี 2564', 'องค์ประกอบอื่นของส่วนของผู้ถือหุ้น งบปี 2565', 'องค์ประกอบอื่นของส่วนของผู้ถือหุ้น งบปี 2566', 'องค์ประกอบอื่นของส่วนของผู้ถือหุ้น ไตรมาส 1/2566', 'องค์ประกอบอื่นของส่วนของผู้ถือหุ้น ไตรมาส 1/2567', '- ส่วนเกิน (ต่ำกว่า) ทุน งบปี 2564', '- ส่วนเกิน (ต่ำกว่า) ทุน งบปี 2565', '- ส่วนเกิน (ต่ำกว่า) ทุน งบปี 2566', '- ส่วนเกิน (ต่ำกว่า) ทุน ไตรมาส 1/2566', '- ส่วนเกิน (ต่ำกว่า) ทุน ไตรมาส 1/2567', 'รวมส่วนของผู้ถือหุ้นบริษัทใหญ่ งบปี 2564', 'รวมส่วนของผู้ถือหุ้นบริษัทใหญ่ งบปี 2565', 'รวมส่วนของผู้ถือหุ้นบริษัทใหญ่ งบปี 2566', 'รวมส่วนของผู้ถือหุ้นบริษัทใหญ่ ไตรมาส 1/2566', 'รวมส่วนของผู้ถือหุ้นบริษัทใหญ่ ไตรมาส 1/2567', 'ส่วนของผู้ถือหุ้นส่วนน้อย งบปี 2564', 'ส่วนของผู้ถือหุ้นส่วนน้อย งบปี 2565', 'ส่วนของผู้ถือหุ้นส่วนน้อย งบปี 2566', 'ส่วนของผู้ถือหุ้นส่วนน้อย ไตรมาส 1/2566', 'ส่วนของผู้ถือหุ้นส่วนน้อย ไตรมาส 1/2567', 'รายได้จากการดำเนินธุรกิจ งบปี 2564', 'รายได้จากการดำเนินธุรกิจ งบปี 2565', 'รายได้จากการดำเนินธุรกิจ งบปี 2566', 'รายได้จากการดำเนินธุรกิจ ไตรมาส 1/2566', 'รายได้จากการดำเนินธุรกิจ ไตรมาส 1/2567', 'รายได้อื่น งบปี 2564', 'รายได้อื่น งบปี 2565', 'รายได้อื่น งบปี 2566', 'รายได้อื่น ไตรมาส 1/2566', 'รายได้อื่น ไตรมาส 1/2567', 'รวมรายได้ งบปี 2564', 'รวมรายได้ งบปี 2565', 'รวมรายได้ งบปี 2566', 'รวมรายได้ ไตรมาส 1/2566', 'รวมรายได้ ไตรมาส 1/2567', 'ต้นทุน งบปี 2564', 'ต้นทุน งบปี 2565', 'ต้นทุน งบปี 2566', 'ต้นทุน ไตรมาส 1/2566', 'ต้นทุน ไตรมาส 1/2567', 'ค่าใช้จ่ายในการขายและบริหาร งบปี 2564', 'ค่าใช้จ่ายในการขายและบริหาร งบปี 2565', 'ค่าใช้จ่ายในการขายและบริหาร งบปี 2566', 'ค่าใช้จ่ายในการขายและบริหาร ไตรมาส 1/2566', 'ค่าใช้จ่ายในการขายและบริหาร ไตรมาส 1/2567', 'รวมต้นทุนและค่าใช้จ่าย งบปี 2564', 'รวมต้นทุนและค่าใช้จ่าย งบปี 2565', 'รวมต้นทุนและค่าใช้จ่าย งบปี 2566', 'รวมต้นทุนและค่าใช้จ่าย ไตรมาส 1/2566', 'รวมต้นทุนและค่าใช้จ่าย ไตรมาส 1/2567', 'EBITDA งบปี 2564', 'EBITDA งบปี 2565', 'EBITDA งบปี 2566', 'EBITDA ไตรมาส 1/2566', 'EBITDA ไตรมาส 1/2567', 'ค่าเสื่อมและค่าตัดจำหน่าย งบปี 2564', 'ค่าเสื่อมและค่าตัดจำหน่าย งบปี 2565', 'ค่าเสื่อมและค่าตัดจำหน่าย งบปี 2566', 'ค่าเสื่อมและค่าตัดจำหน่าย ไตรมาส 1/2566', 'ค่าเสื่อมและค่าตัดจำหน่าย ไตรมาส 1/2567', 'กำไร (ขาดทุน) ก่อนต้นทุนทางการเงิน และภาษีเงินได้ งบปี 2564', 'กำไร (ขาดทุน) ก่อนต้นทุนทางการเงิน และภาษีเงินได้ งบปี 2565', 'กำไร (ขาดทุน) ก่อนต้นทุนทางการเงิน และภาษีเงินได้ งบปี 2566', 'กำไร (ขาดทุน) ก่อนต้นทุนทางการเงิน และภาษีเงินได้ ไตรมาส 1/2566', 'กำไร (ขาดทุน) ก่อนต้นทุนทางการเงิน และภาษีเงินได้ ไตรมาส 1/2567', 'กำไร(ขาดทุน)สุทธิ : ผู้ถือหุ้นบริษัทใหญ่ งบปี 2564', 'กำไร(ขาดทุน)สุทธิ : ผู้ถือหุ้นบริษัทใหญ่ งบปี 2565', 'กำไร(ขาดทุน)สุทธิ : ผู้ถือหุ้นบริษัทใหญ่ งบปี 2566', 'กำไร(ขาดทุน)สุทธิ : ผู้ถือหุ้นบริษัทใหญ่ ไตรมาส 1/2566', 'กำไร(ขาดทุน)สุทธิ : ผู้ถือหุ้นบริษัทใหญ่ ไตรมาส 1/2567', 'กำไรต่อหุ้น (บาท) งบปี 2564', 'กำไรต่อหุ้น (บาท) งบปี 2565', 'กำไรต่อหุ้น (บาท) งบปี 2566', 'กำไรต่อหุ้น (บาท) ไตรมาส 1/2566', 'กำไรต่อหุ้น (บาท) ไตรมาส 1/2567', 'เงินสดสุทธิจากกิจกรรมดำเนินงาน งบปี 2564', 'เงินสดสุทธิจากกิจกรรมดำเนินงาน งบปี 2565', 'เงินสดสุทธิจากกิจกรรมดำเนินงาน งบปี 2566', 'เงินสดสุทธิจากกิจกรรมดำเนินงาน ไตรมาส 1/2566', 'เงินสดสุทธิจากกิจกรรมดำเนินงาน ไตรมาส 1/2567', 'เงินสดสุทธิจากกิจกรรมลงทุน งบปี 2564', 'เงินสดสุทธิจากกิจกรรมลงทุน งบปี 2565', 'เงินสดสุทธิจากกิจกรรมลงทุน งบปี 2566', 'เงินสดสุทธิจากกิจกรรมลงทุน ไตรมาส 1/2566', 'เงินสดสุทธิจากกิจกรรมลงทุน ไตรมาส 1/2567', 'เงินสดสุทธิจากกิจกรรมจัดหาเงิน งบปี 2564', 'เงินสดสุทธิจากกิจกรรมจัดหาเงิน งบปี 2565', 'เงินสดสุทธิจากกิจกรรมจัดหาเงิน งบปี 2566', 'เงินสดสุทธิจากกิจกรรมจัดหาเงิน ไตรมาส 1/2566', 'เงินสดสุทธิจากกิจกรรมจัดหาเงิน ไตรมาส 1/2567', 'เงินสดสุทธิ งบปี 2564', 'เงินสดสุทธิ งบปี 2565', 'เงินสดสุทธิ งบปี 2566', 'เงินสดสุทธิ ไตรมาส 1/2566', 'เงินสดสุทธิ ไตรมาส 1/2567', 'อัตราส่วนสภาพคล่อง (เท่า) งบปี 2565', 'อัตราส่วนสภาพคล่อง (เท่า) งบปี 2566', 'อัตราส่วนสภาพคล่อง (เท่า) ไตรมาส 1/2566', 'อัตราส่วนสภาพคล่อง (เท่า) ไตรมาส 1/2567', 'อัตราผลตอบแทนผู้ถือหุ้น (%) งบปี 2565', 'อัตราผลตอบแทนผู้ถือหุ้น (%) งบปี 2566', 'อัตราผลตอบแทนผู้ถือหุ้น (%) ไตรมาส 1/2566', 'อัตราผลตอบแทนผู้ถือหุ้น (%) ไตรมาส 1/2567', 'อัตราผลตอบแทนจากสินทรัพย์ (%) งบปี 2565', 'อัตราผลตอบแทนจากสินทรัพย์ (%) งบปี 2566', 'อัตราผลตอบแทนจากสินทรัพย์ (%) ไตรมาส 1/2566', 'อัตราผลตอบแทนจากสินทรัพย์ (%) ไตรมาส 1/2567', 'อัตราส่วนหนี้สินต่อส่วนของผู้ถือหุ้น (เท่า) งบปี 2565', 'อัตราส่วนหนี้สินต่อส่วนของผู้ถือหุ้น (เท่า) งบปี 2566', 'อัตราส่วนหนี้สินต่อส่วนของผู้ถือหุ้น (เท่า) ไตรมาส 1/2566', 'อัตราส่วนหนี้สินต่อส่วนของผู้ถือหุ้น (เท่า) ไตรมาส 1/2567', 'อัตราส่วนหมุนเวียนทรัพย์สิน (เท่า) งบปี 2565', 'อัตราส่วนหมุนเวียนทรัพย์สิน (เท่า) งบปี 2566', 'อัตราส่วนหมุนเวียนทรัพย์สิน (เท่า) ไตรมาส 1/2566', 'อัตราส่วนหมุนเวียนทรัพย์สิน (เท่า) ไตรมาส 1/2567', 'อัตรากำไรขั้นต้น (%) งบปี 2565', 'อัตรากำไรขั้นต้น (%) งบปี 2566', 'อัตรากำไรขั้นต้น (%) ไตรมาส 1/2566', 'อัตรากำไรขั้นต้น (%) ไตรมาส 1/2567', 'EBIT Margin (%) งบปี 2565', 'EBIT Margin (%) งบปี 2566', 'EBIT Margin (%) ไตรมาส 1/2566', 'EBIT Margin (%) ไตรมาส 1/2567', 'อัตรากำไรสุทธิ (%) งบปี 2565', 'อัตรากำไรสุทธิ (%) งบปี 2566', 'อัตรากำไรสุทธิ (%) ไตรมาส 1/2566', 'อัตรากำไรสุทธิ (%) ไตรมาส 1/2567', 'อัตราการเปลี่ยนแปลงยอดขาย งบปี 2565', 'อัตราการเปลี่ยนแปลงยอดขาย งบปี 2566', 'อัตราการเปลี่ยนแปลงยอดขาย ไตรมาส 1/2566', 'อัตราการเปลี่ยนแปลงยอดขาย ไตรมาส 1/2567', 'อัตราการเปลี่ยนแปลงต้นทุนขาย งบปี 2565', 'อัตราการเปลี่ยนแปลงต้นทุนขาย งบปี 2566', 'อัตราการเปลี่ยนแปลงต้นทุนขาย ไตรมาส 1/2566', 'อัตราการเปลี่ยนแปลงต้นทุนขาย ไตรมาส 1/2567', 'อัตราการเปลี่ยนแปลงรายได้รวม งบปี 2565', 'อัตราการเปลี่ยนแปลงรายได้รวม งบปี 2566', 'อัตราการเปลี่ยนแปลงรายได้รวม ไตรมาส 1/2566', 'อัตราการเปลี่ยนแปลงรายได้รวม ไตรมาส 1/2567', 'อัตราการเปลี่ยนแปลงค่าใช้จ่ายรวม งบปี 2565', 'อัตราการเปลี่ยนแปลงค่าใช้จ่ายรวม งบปี 2566', 'อัตราการเปลี่ยนแปลงค่าใช้จ่ายรวม ไตรมาส 1/2566', 'อัตราการเปลี่ยนแปลงค่าใช้จ่ายรวม ไตรมาส 1/2567', 'อัตราการเปลี่ยนแปลงกำไรสุทธิ งบปี 2565', 'อัตราการเปลี่ยนแปลงกำไรสุทธิ งบปี 2566', 'อัตราการเปลี่ยนแปลงกำไรสุทธิ ไตรมาส 1/2566', 'อัตราการเปลี่ยนแปลงกำไรสุทธิ ไตรมาส 1/2567', 'อัตราส่วนหมุนเวียนลูกหนี้การค้า (เท่า) งบปี 2565', 'อัตราส่วนหมุนเวียนลูกหนี้การค้า (เท่า) งบปี 2566', 'อัตราส่วนหมุนเวียนลูกหนี้การค้า (เท่า) ไตรมาส 1/2566', 'อัตราส่วนหมุนเวียนลูกหนี้การค้า (เท่า) ไตรมาส 1/2567', 'ระยะเวลาเก็บหนี้เฉลี่ย (วัน) งบปี 2565', 'ระยะเวลาเก็บหนี้เฉลี่ย (วัน) งบปี 2566', 'ระยะเวลาเก็บหนี้เฉลี่ย (วัน) ไตรมาส 1/2566', 'ระยะเวลาเก็บหนี้เฉลี่ย (วัน) ไตรมาส 1/2567', 'อัตราส่วนหมุนเวียนสินค้าคงเหลือ (เท่า) งบปี 2565', 'อัตราส่วนหมุนเวียนสินค้าคงเหลือ (เท่า) งบปี 2566', 'อัตราส่วนหมุนเวียนสินค้าคงเหลือ (เท่า) ไตรมาส 1/2566', 'อัตราส่วนหมุนเวียนสินค้าคงเหลือ (เท่า) ไตรมาส 1/2567', 'ระยะเวลาขายสินค้าเฉลี่ย (วัน) งบปี 2565', 'ระยะเวลาขายสินค้าเฉลี่ย (วัน) งบปี 2566', 'ระยะเวลาขายสินค้าเฉลี่ย (วัน) ไตรมาส 1/2566', 'ระยะเวลาขายสินค้าเฉลี่ย (วัน) ไตรมาส 1/2567', 'อัตราส่วนหมุนเวียนเจ้าหนี้การค้า (เท่า) งบปี 2565', 'อัตราส่วนหมุนเวียนเจ้าหนี้การค้า (เท่า) งบปี 2566', 'อัตราส่วนหมุนเวียนเจ้าหนี้การค้า (เท่า) ไตรมาส 1/2566', 'อัตราส่วนหมุนเวียนเจ้าหนี้การค้า (เท่า) ไตรมาส 1/2567', 'ระยะเวลาชำระหนี้เจ้าหนี้การค้า (วัน) งบปี 2565', 'ระยะเวลาชำระหนี้เจ้าหนี้การค้า (วัน) งบปี 2566', 'ระยะเวลาชำระหนี้เจ้าหนี้การค้า (วัน) ไตรมาส 1/2566', 'ระยะเวลาชำระหนี้เจ้าหนี้การค้า (วัน) ไตรมาส 1/2567', 'วงจรเงินสด (วัน) งบปี 2565', 'วงจรเงินสด (วัน) งบปี 2566', 'วงจรเงินสด (วัน) ไตรมาส 1/2566', 'วงจรเงินสด (วัน) ไตรมาส 1/2567']

            #print("CSV Headers:", header)
            #print("Expected Fields:", expected_fields)
            '''
            if header != expected_fields:
                return render(request, 'stocks/upload_csv.html', {
                    'form': forms,
                    'error': 'CSV file headers do not match expected fields.'
                })
            else:
                return render(request, 'stocks/upload_csv.html', {
                    'info': 'CSV file headers are match expected fields.'
                })
            
            for row in reader:
                if len(row) != len(expected_fields):
                    return render(request, 'stocks/upload_csv.html', {
                        'form': forms,
                        'error': 'CSV file row does not match expected number of columns.',
                    })
                else:
                    return render(request, 'stocks/upload_csv.html', {
                        'info': 'CSV file row match expected number of columns'
                    })
            '''
            #print(f"reader is {reader}")
            try:
                for row in reader:
                    #print(f"row is {row}")
                    #print(f"len of reader{reader}")
                    print(f"Symbol is {row[0]}")
                    print(f"Paid up is {row[1]}")
                    print(f"Cash_Cycle_Days_Q12024 is {row[278]}\n")
                    data = list(reader)
                    #print(f"data is {data}")
                    
                    stock, created = Stock.objects.update_or_create(
                        symbol=row[0],
                        defaults={
                            'Paid_up': float(row[1]), #'Paid-up(ล้านบาท)']),
                            'MarketCap': float(row[2]), #'MarketCap(ล้านบาท)']),
                            'EV ': float(row[3]), #'EV(ล้านบาท)']),
                            'EBITDA ': float(row[4]), #'EBITDA(ล้านบาท)']),
                            'EV_EBITDA ': float(row[5]), #'EV/EBITDA']),
                            'Price ': float(row[6]), #'Price(บาท)']),
                            'P_E ': float(row[7]), #'P/E(X)']),
                            'P_BV ': float(row[8]), # , #'P/BV(X)']),

                            'Cash_YE2021 ': float(row[9]), #'เงินสดและรายการเทียบเท่าเงินสด งบปี 2564']),
                            'Cash_YE2022 ': float(row[10]), #'เงินสดและรายการเทียบเท่าเงินสด งบปี 2565']),
                            'Cash_YE2023 ': float(row[11]), #'เงินสดและรายการเทียบเท่าเงินสด งบปี 2566']),
                            'Cash_Q12023 ': float(row[12]), #'เงินสดและรายการเทียบเท่าเงินสด ไตรมาส 1/2566']),
                            'Cash_Q12024 ': float(row[13]), #'เงินสดและรายการเทียบเท่าเงินสด ไตรมาส 1/2567']),
                            'A_R_Net_YE2021 ': float(row[14]), #'ลูกหนี้และตั๋วเงินรับการค้าสุทธิ งบปี 2564']),
                            'A_R_Net_YE2022 ': float(row[15]), #'ลูกหนี้และตั๋วเงินรับการค้าสุทธิ งบปี 2565']),
                            'A_R_Net_YE2023 ': float(row[16]), #'ลูกหนี้และตั๋วเงินรับการค้าสุทธิ งบปี 2566']),
                            'A_R_Net_Q12023 ': float(row[17]), #'ลูกหนี้และตั๋วเงินรับการค้าสุทธิ ไตรมาส 1/2566']),
                            'A_R_Net_Q12024 ': float(row[18]), #'ลูกหนี้และตั๋วเงินรับการค้าสุทธิ ไตรมาส 1/2567']),
                            'Inventories_YE2021 ': float(row[19]), #'สินค้าคงเหลือ งบปี 2564']),
                            'Inventories_YE2022 ': float(row[20]), #'สินค้าคงเหลือ งบปี 2565']),
                            'Inventories_YE2023 ': float(row[21]), #'สินค้าคงเหลือ งบปี 2566']),
                            'Inventories_Q12023 ': float(row[22]), #'สินค้าคงเหลือ ไตรมาส 1/2566']),
                            'Inventories_Q12024 ': float(row[23]), #'สินค้าคงเหลือ ไตรมาส 1/2567']),
                            'Current_Assets_YE2021 ': float(row[24]), #'รวมสินทรัพย์หมุนเวียน งบปี 2564']),
                            'Current_Assets_YE2022 ': float(row[25]), #'รวมสินทรัพย์หมุนเวียน งบปี 2565']),
                            'Current_Assets_YE2023 ': float(row[26]), #'รวมสินทรัพย์หมุนเวียน งบปี 2566']),
                            'Current_Assets_Q12023 ': float(row[27]), #'รวมสินทรัพย์หมุนเวียน ไตรมาส 1/2566']),
                            'Current_Assets_Q12024 ': float(row[28]), #'รวมสินทรัพย์หมุนเวียน ไตรมาส 1/2567']),
                            'PP_E_Net_YE2021 ': float(row[29]), #'ที่ดินอาคารและอุปกรณ์สุทธิ งบปี 2564']),
                            'PP_E_Net_YE2022 ': float(row[30]), #'ที่ดินอาคารและอุปกรณ์สุทธิ งบปี 2565']),
                            'PP_E_Net_YE2023 ': float(row[31]), #'ที่ดินอาคารและอุปกรณ์สุทธิ งบปี 2566']),
                            'PP_E_Net_Q12023 ': float(row[32]), #'ที่ดินอาคารและอุปกรณ์สุทธิ ไตรมาส 1/2566']),
                            'PP_E_Net_Q12024 ': float(row[33]), #'ที่ดินอาคารและอุปกรณ์สุทธิ ไตรมาส 1/2567']),
                            'Non_Current_Assets_YE2021 ': float(row[34]), #'รวมสินทรัพย์ไม่หมุนเวียน งบปี 2564']),
                            'Non_Current_Assets_YE2022 ': float(row[35]), #'รวมสินทรัพย์ไม่หมุนเวียน งบปี 2565']),
                            'Non_Current_Assets_YE2023 ': float(row[36]), #'รวมสินทรัพย์ไม่หมุนเวียน งบปี 2566']),
                            'Non_Current_Assets_Q12023 ': float(row[37]), #'รวมสินทรัพย์ไม่หมุนเวียน ไตรมาส 1/2566']),
                            'Non_Current_Assets_Q12024 ': float(row[38]), #'รวมสินทรัพย์ไม่หมุนเวียน ไตรมาส 1/2567']),
                            'Total_Assets_YE2021 ': float(row[39]), #'รวมสินทรัพย์ งบปี 2564']),
                            'Total_Assets_YE2022 ': float(row[40]), #'รวมสินทรัพย์ งบปี 2565']),
                            'Total_Assets_YE2023 ': float(row[41]), #'รวมสินทรัพย์ งบปี 2566']),
                            'Total_Assets_Q12023 ': float(row[42]), #'รวมสินทรัพย์ ไตรมาส 1/2566']),
                            'Total_Assets_Q12024 ': float(row[43]), #'รวมสินทรัพย์ ไตรมาส 1/2567']),
                            'O_D_YE2021 ': float(row[44]), #'เงินเบิกเกินบัญชีและเงินกู้ยืม งบปี 2564']),
                            'O_D_YE2022 ': float(row[45]), #'เงินเบิกเกินบัญชีและเงินกู้ยืม งบปี 2565']),
                            'O_D_YE2023 ': float(row[46]), #'เงินเบิกเกินบัญชีและเงินกู้ยืม งบปี 2566']),
                            'O_D_Q12023 ': float(row[47]), #'เงินเบิกเกินบัญชีและเงินกู้ยืม ไตรมาส 1/2566']),
                            'O_D_Q12024 ': float(row[48]), #'เงินเบิกเกินบัญชีและเงินกู้ยืม ไตรมาส 1/2567']),
                            'A_P_Net_YE2021 ': float(row[49]), #'เจ้าหนี้และตั๋วเงินจ่ายการค้าสุทธิ งบปี 2564']),
                            'A_P_Net_YE2022 ': float(row[50]), #'เจ้าหนี้และตั๋วเงินจ่ายการค้าสุทธิ งบปี 2565']),
                            'A_P_Net_YE2023 ': float(row[51]), #'เจ้าหนี้และตั๋วเงินจ่ายการค้าสุทธิ งบปี 2566']),
                            'A_P_Net_Q12023 ': float(row[52]), #'เจ้าหนี้และตั๋วเงินจ่ายการค้าสุทธิ ไตรมาส 1/2566']),
                            'A_P_Net_Q12024 ': float(row[53]), #'เจ้าหนี้และตั๋วเงินจ่ายการค้าสุทธิ ไตรมาส 1/2567']),
                            'Current_portion_LT_YE2021 ': float(row[54]), #'หนี้สินระยะยาวที่ถึงกำหนดชำระภายในหนึ่งปี งบปี 2564']),
                            'Current_portion_LT_YE2022 ': float(row[55]), #'หนี้สินระยะยาวที่ถึงกำหนดชำระภายในหนึ่งปี งบปี 2565']),
                            'Current_portion_LT_YE2023 ': float(row[56]), #'หนี้สินระยะยาวที่ถึงกำหนดชำระภายในหนึ่งปี งบปี 2566']),
                            'Current_portion_LT_Q12023 ': float(row[57]), #'หนี้สินระยะยาวที่ถึงกำหนดชำระภายในหนึ่งปี ไตรมาส 1/2566']),
                            'Current_portion_LT_Q12024 ': float(row[58]), #'หนี้สินระยะยาวที่ถึงกำหนดชำระภายในหนึ่งปี ไตรมาส 1/2567']),
                            'Current_Liabilities_YE2021 ': float(row[59]), #'รวมหนี้สินหมุนเวียน งบปี 2564']),
                            'Current_Liabilities_YE2022 ': float(row[60]), #'รวมหนี้สินหมุนเวียน งบปี 2565']),
                            'Current_Liabilities_YE2023 ': float(row[61]), #'รวมหนี้สินหมุนเวียน งบปี 2566']),
                            'Current_Liabilities_Q12023 ': float(row[62]), #'รวมหนี้สินหมุนเวียน ไตรมาส 1/2566']),
                            'Current_Liabilities_Q12024 ': float(row[63]), #'รวมหนี้สินหมุนเวียน ไตรมาส 1/2567']),
                            'Non_Current_Liabilities_YE2021 ': float(row[64]), #'รวมหนี้สินไม่หมุนเวียน งบปี 2564']),
                            'Non_Current_Liabilities_YE2022 ': float(row[65]), #'รวมหนี้สินไม่หมุนเวียน งบปี 2565']),
                            'Non_Current_Liabilities_YE2023 ': float(row[66]), #'รวมหนี้สินไม่หมุนเวียน งบปี 2566']),
                            'Non_Current_Liabilities_Q12023 ': float(row[67]), #'รวมหนี้สินไม่หมุนเวียน ไตรมาส 1/2566']),
                            'Non_Current_Liabilities_Q12024 ': float(row[68]), #'รวมหนี้สินไม่หมุนเวียน ไตรมาส 1/2567']),
                            'Total_Liabilities_YE2021 ': float(row[69]), #'รวมหนี้สิน งบปี 2564']),
                            'Total_Liabilities_YE2022 ': float(row[70]), #'รวมหนี้สิน งบปี 2565']),
                            'Total_Liabilities_YE2023 ': float(row[71]), #'รวมหนี้สิน งบปี 2566']),
                            'Total_Liabilities_Q12023 ': float(row[72]), #'รวมหนี้สิน ไตรมาส 1/2566']),
                            'Total_Liabilities_Q12024 ': float(row[73]), #'รวมหนี้สิน ไตรมาส 1/2567']),
                            'Authorized_Capital_YE2021 ': float(row[74]), #'ทุนจดทะเบียน งบปี 2564']),
                            'Authorized_Capital_YE2022 ': float(row[75]), #'ทุนจดทะเบียน งบปี 2565']),
                            'Authorized_Capital_YE2023 ': float(row[76]), #'ทุนจดทะเบียน งบปี 2566']),
                            'Authorized_Capital_Q12023 ': float(row[77]), #'ทุนจดทะเบียน ไตรมาส 1/2566']),
                            'Authorized_Capital_Q12024 ': float(row[78]), #'ทุนจดทะเบียน ไตรมาส 1/2567']),
                            'Paid_up_Capital_YE2021 ': float(row[79]), #'ทุนที่ออกและชำระเต็มมูลค่า งบปี 2564']),
                            'Paid_up_Capital_YE2022 ': float(row[80]), #'ทุนที่ออกและชำระเต็มมูลค่า งบปี 2565']),
                            'Paid_up_Capital_YE2023 ': float(row[81]), #'ทุนที่ออกและชำระเต็มมูลค่า งบปี 2566']),
                            'Paid_up_Capital_Q12023 ': float(row[82]), #'ทุนที่ออกและชำระเต็มมูลค่า ไตรมาส 1/2566']),
                            'Paid_up_Capital_Q12024 ': float(row[83]), #'ทุนที่ออกและชำระเต็มมูลค่า ไตรมาส 1/2567']),
                            'Premium_Share_Capital_YE2021 ': float(row[84]), #'ส่วนเกิน(ต่ำกว่า)มูลค่าหุ้น งบปี 2564']),
                            'Premium_Share_Capital_YE2022 ': float(row[85]), #'ส่วนเกิน(ต่ำกว่า)มูลค่าหุ้น งบปี 2565']),
                            'Premium_Share_Capital_YE2023 ': float(row[86]), #'ส่วนเกิน(ต่ำกว่า)มูลค่าหุ้น งบปี 2566']),
                            'Premium_Share_Capital_Q12023 ': float(row[87]), #'ส่วนเกิน(ต่ำกว่า)มูลค่าหุ้น ไตรมาส 1/2566']),
                            'Premium_Share_Capital_Q12024 ': float(row[88]), #'ส่วนเกิน(ต่ำกว่า)มูลค่าหุ้น ไตรมาส 1/2567']),
                            'Retained_Earnings_YE2021 ': float(row[89]), #'กำไร(ขาดทุน)สะสม งบปี 2564']),
                            'Retained_Earnings_YE2022 ': float(row[90]), #'กำไร(ขาดทุน)สะสม งบปี 2565']),
                            'Retained_Earnings_YE2023 ': float(row[91]), #'กำไร(ขาดทุน)สะสม งบปี 2566']),
                            'Retained_Earnings_Q12023 ': float(row[92]), #'กำไร(ขาดทุน)สะสม ไตรมาส 1/2566']),
                            'Retained_Earnings_Q12024 ': float(row[93]), #'กำไร(ขาดทุน)สะสม ไตรมาส 1/2567']),
                            'Treasury_Stock_YE2021 ': float(row[94]), #'หุ้นทุนรับซื้อคืน งบปี 2564']),
                            'Treasury_Stock_YE2022 ': float(row[95]), #'หุ้นทุนรับซื้อคืน งบปี 2565']),
                            'Treasury_Stock_YE2023 ': float(row[96]), #'หุ้นทุนรับซื้อคืน งบปี 2566']),
                            'Treasury_Stock_Q12023 ': float(row[97]), #'หุ้นทุนรับซื้อคืน ไตรมาส 1/2566']),
                            'Treasury_Stock_Q12024 ': float(row[98]), #'หุ้นทุนรับซื้อคืน ไตรมาส 1/2567']),
                            'Share_Company_Subsidiaries_YE2021 ': float(row[99]), #'หุ้นที่ถือโดยบริษัทย่อย งบปี 2564']),
                            'Share_Company_Subsidiaries_YE2022 ': float(row[100]), #'หุ้นที่ถือโดยบริษัทย่อย งบปี 2565']),
                            'Share_Company_Subsidiaries_YE2023 ': float(row[101]), #'หุ้นที่ถือโดยบริษัทย่อย งบปี 2566']),
                            'Share_Company_Subsidiaries_Q12023 ': float(row[102]), #'หุ้นที่ถือโดยบริษัทย่อย ไตรมาส 1/2566']),
                            'Share_Company_Subsidiaries_Q12024 ': float(row[103]), #'หุ้นที่ถือโดยบริษัทย่อย ไตรมาส 1/2567']),
                            'Other_Component_Equity_YE2021 ': float(row[104]), #'องค์ประกอบอื่นของส่วนของผู้ถือหุ้น งบปี 2564']),
                            'Other_Component_Equity_YE2022 ': float(row[105]), #'องค์ประกอบอื่นของส่วนของผู้ถือหุ้น งบปี 2565']),
                            'Other_Component_Equity_YE2023 ': float(row[106]), #'องค์ประกอบอื่นของส่วนของผู้ถือหุ้น งบปี 2566']),
                            'Other_Component_Equity_Q12023 ': float(row[107]), #'องค์ประกอบอื่นของส่วนของผู้ถือหุ้น ไตรมาส 1/2566']),
                            'Other_Component_Equity_Q12024 ': float(row[108]), #'องค์ประกอบอื่นของส่วนของผู้ถือหุ้น ไตรมาส 1/2567']),
                            'Surplus_YE2021 ': float(row[109]), #'- ส่วนเกิน (ต่ำกว่า) ทุน งบปี 2564']),
                            'Surplus_YE2022 ': float(row[110]), #'- ส่วนเกิน (ต่ำกว่า) ทุน งบปี 2565']),
                            'Surplus_YE2023 ': float(row[111]), #'- ส่วนเกิน (ต่ำกว่า) ทุน งบปี 2566']),
                            'Surplus_Q12023 ': float(row[112]), #'- ส่วนเกิน (ต่ำกว่า) ทุน ไตรมาส 1/2566']),
                            'Surplus_Q12024 ': float(row[113]), #'- ส่วนเกิน (ต่ำกว่า) ทุน ไตรมาส 1/2567']),
                            'Shareholders_Equity_YE2021 ': float(row[114]), #'รวมส่วนของผู้ถือหุ้นบริษัทใหญ่ งบปี 2564']),
                            'Shareholders_Equity_YE2022 ': float(row[115]), #'รวมส่วนของผู้ถือหุ้นบริษัทใหญ่ งบปี 2565']),
                            'Shareholders_Equity_YE2023 ': float(row[116]), #'รวมส่วนของผู้ถือหุ้นบริษัทใหญ่ งบปี 2566']),
                            'Shareholders_Equity_Q12023 ': float(row[117]), #'รวมส่วนของผู้ถือหุ้นบริษัทใหญ่ ไตรมาส 1/2566']),
                            'Shareholders_Equity_Q12024 ': float(row[118]), #'รวมส่วนของผู้ถือหุ้นบริษัทใหญ่ ไตรมาส 1/2567']),
                            'Minority_Interest_YE2021 ': float(row[119]), #'ส่วนของผู้ถือหุ้นส่วนน้อย งบปี 2564']),
                            'Minority_Interest_YE2022 ': float(row[120]), #'ส่วนของผู้ถือหุ้นส่วนน้อย งบปี 2565']),
                            'Minority_Interest_YE2023 ': float(row[121]), #'ส่วนของผู้ถือหุ้นส่วนน้อย งบปี 2566']),
                            'Minority_Interest_Q12023 ': float(row[122]), #'ส่วนของผู้ถือหุ้นส่วนน้อย ไตรมาส 1/2566']),
                            'Minority_Interest_Q12024 ': float(row[123]), #'ส่วนของผู้ถือหุ้นส่วนน้อย ไตรมาส 1/2567']),
                            'Revenue_From_Operations_YE2021 ': float(row[124]), #'รายได้จากการดำเนินธุรกิจ งบปี 2564']),
                            'Revenue_From_Operations_YE2022 ': float(row[125]), #'รายได้จากการดำเนินธุรกิจ งบปี 2565']),
                            'Revenue_From_Operations_YE2023 ': float(row[126]), #'รายได้จากการดำเนินธุรกิจ งบปี 2566']),
                            'Revenue_From_Operations_Q12023 ': float(row[127]), #'รายได้จากการดำเนินธุรกิจ ไตรมาส 1/2566']),
                            'Revenue_From_Operations_Q12024 ': float(row[128]), #'รายได้จากการดำเนินธุรกิจ ไตรมาส 1/2567']),
                            'Other_Income_YE2021 ': float(row[129]), #'รายได้อื่น งบปี 2564']),
                            'Other_Income_YE2022 ': float(row[130]), #'รายได้อื่น งบปี 2565']),
                            'Other_Income_YE2023 ': float(row[131]), #'รายได้อื่น งบปี 2566']),
                            'Other_Income_Q12023 ': float(row[132]), #'รายได้อื่น ไตรมาส 1/2566']),
                            'Other_Income_Q12024 ': float(row[133]), #'รายได้อื่น ไตรมาส 1/2567']),
                            'Total_Revenues_YE2021 ': float(row[134]), #'รวมรายได้ งบปี 2564']),
                            'Total_Revenues_YE2022 ': float(row[135]), #'รวมรายได้ งบปี 2565']),
                            'Total_Revenues_YE2023 ': float(row[136]), #'รวมรายได้ งบปี 2566']),
                            'Total_Revenues_Q12023 ': float(row[137]), #'รวมรายได้ ไตรมาส 1/2566']),
                            'Total_Revenues_Q12024 ': float(row[138]), #'รวมรายได้ ไตรมาส 1/2567']),
                            'Costs_YE2021 ': float(row[139]), #'ต้นทุน งบปี 2564']),
                            'Costs_YE2022 ': float(row[140]), #'ต้นทุน งบปี 2565']),
                            'Costs_YE2023 ': float(row[141]), #'ต้นทุน งบปี 2566']),
                            'Costs_Q12023 ': float(row[142]), #'ต้นทุน ไตรมาส 1/2566']),
                            'Costs_Q12024 ': float(row[143]), #'ต้นทุน ไตรมาส 1/2567']),
                            'Sell_Administrative_Expenses_YE2021 ': float(row[144]), #'ค่าใช้จ่ายในการขายและบริหาร งบปี 2564']),
                            'Sell_Administrative_Expenses_YE2022 ': float(row[145]), #'ค่าใช้จ่ายในการขายและบริหาร งบปี 2565']),
                            'Sell_Administrative_Expenses_YE2023 ': float(row[146]), #'ค่าใช้จ่ายในการขายและบริหาร งบปี 2566']),
                            'Sell_Administrative_Expenses_Q12023 ': float(row[147]), #'ค่าใช้จ่ายในการขายและบริหาร ไตรมาส 1/2566']),
                            'Sell_Administrative_Expenses_Q12024 ': float(row[148]), #'ค่าใช้จ่ายในการขายและบริหาร ไตรมาส 1/2567']),
                            'Total_Cost_Expenses_YE2021 ': float(row[149]), #'รวมต้นทุนและค่าใช้จ่าย งบปี 2564']),
                            'Total_Cost_Expenses_YE2022 ': float(row[150]), #'รวมต้นทุนและค่าใช้จ่าย งบปี 2565']),
                            'Total_Cost_Expenses_YE2023 ': float(row[151]), #'รวมต้นทุนและค่าใช้จ่าย งบปี 2566']),
                            'Total_Cost_Expenses_Q12023 ': float(row[152]), #'รวมต้นทุนและค่าใช้จ่าย ไตรมาส 1/2566']),
                            'Total_Cost_Expenses_Q12024 ': float(row[153]), #'รวมต้นทุนและค่าใช้จ่าย ไตรมาส 1/2567']),
                            'EBITDA_YE2021 ': float(row[154]), #'EBITDA งบปี 2564']),
                            'EBITDA_YE2022 ': float(row[155]), #'EBITDA งบปี 2565']),
                            'EBITDA_YE2023 ': float(row[156]), #'EBITDA งบปี 2566']),
                            'EBITDA_Q12023 ': float(row[157]), #'EBITDA ไตรมาส 1/2566']),
                            'EBITDA_Q12024 ': float(row[158]), #'EBITDA ไตรมาส 1/2567']),
                            'Depre_Amor_YE2021 ': float(row[159]), #'ค่าเสื่อมและค่าตัดจำหน่าย งบปี 2564']),
                            'Depre_Amor_YE2022 ': float(row[160]), #'ค่าเสื่อมและค่าตัดจำหน่าย งบปี 2565']),
                            'Depre_Amor_YE2023 ': float(row[161]), #'ค่าเสื่อมและค่าตัดจำหน่าย งบปี 2566']),
                            'Depre_Amor_Q12023 ': float(row[162]), #'ค่าเสื่อมและค่าตัดจำหน่าย ไตรมาส 1/2566']),
                            'Depre_Amor_Q12024 ': float(row[163]), #'ค่าเสื่อมและค่าตัดจำหน่าย ไตรมาส 1/2567']),
                            'EBIT_YE2021 ': float(row[164]), #'กำไร (ขาดทุน) ก่อนต้นทุนทางการเงิน และภาษีเงินได้ งบปี 2564']),
                            'EBIT_YE2022 ': float(row[165]), #'กำไร (ขาดทุน) ก่อนต้นทุนทางการเงิน และภาษีเงินได้ งบปี 2565']),
                            'EBIT_YE2023 ': float(row[166]), #'กำไร (ขาดทุน) ก่อนต้นทุนทางการเงิน และภาษีเงินได้ งบปี 2566']),
                            'EBIT_Q12023 ': float(row[167]), #'กำไร (ขาดทุน) ก่อนต้นทุนทางการเงิน และภาษีเงินได้ ไตรมาส 1/2566']),
                            'EBIT_Q12024 ': float(row[168]), #'กำไร (ขาดทุน) ก่อนต้นทุนทางการเงิน และภาษีเงินได้ ไตรมาส 1/2567']),
                            'Net_Profit_YE2021 ': float(row[169]), #'กำไร(ขาดทุน)สุทธิ : ผู้ถือหุ้นบริษัทใหญ่ งบปี 2564']),
                            'Net_Profit_YE2022 ': float(row[170]), #'กำไร(ขาดทุน)สุทธิ : ผู้ถือหุ้นบริษัทใหญ่ งบปี 2565']),
                            'Net_Profit_YE2023 ': float(row[171]), #'กำไร(ขาดทุน)สุทธิ : ผู้ถือหุ้นบริษัทใหญ่ งบปี 2566']),
                            'Net_Profit_Q12023 ': float(row[172]), #'กำไร(ขาดทุน)สุทธิ : ผู้ถือหุ้นบริษัทใหญ่ ไตรมาส 1/2566']),
                            'Net_Profit_Q12024 ': float(row[173]), #'กำไร(ขาดทุน)สุทธิ : ผู้ถือหุ้นบริษัทใหญ่ ไตรมาส 1/2567']),
                            'EPS_YE2021 ': float(row[174]), #'กำไรต่อหุ้น (บาท) งบปี 2564']),
                            'EPS_YE2022 ': float(row[175]), #'กำไรต่อหุ้น (บาท) งบปี 2565']),
                            'EPS_YE2023 ': float(row[176]), #'กำไรต่อหุ้น (บาท) งบปี 2566']),
                            'EPS_Q12023 ': float(row[177]), #'กำไรต่อหุ้น (บาท) ไตรมาส 1/2566']),
                            'EPS_Q12024 ': float(row[178]), #'กำไรต่อหุ้น (บาท) ไตรมาส 1/2567']),
                            'Operating_Cash_Flow_YE2021 ': float(row[179]), #'เงินสดสุทธิจากกิจกรรมดำเนินงาน งบปี 2564']),
                            'Operating_Cash_Flow_YE2022 ': float(row[180]), #'เงินสดสุทธิจากกิจกรรมดำเนินงาน งบปี 2565']),
                            'Operating_Cash_Flow_YE2023 ': float(row[181]), #'เงินสดสุทธิจากกิจกรรมดำเนินงาน งบปี 2566']),
                            'Operating_Cash_Flow_Q12023 ': float(row[182]), #'เงินสดสุทธิจากกิจกรรมดำเนินงาน ไตรมาส 1/2566']),
                            'Operating_Cash_Flow_Q12024 ': float(row[183]), #'เงินสดสุทธิจากกิจกรรมดำเนินงาน ไตรมาส 1/2567']),
                            'Investing_Cash_Flow_YE2021 ': float(row[184]), #'เงินสดสุทธิจากกิจกรรมลงทุน งบปี 2564']),
                            'Investing_Cash_Flow_YE2022 ': float(row[185]), #'เงินสดสุทธิจากกิจกรรมลงทุน งบปี 2565']),
                            'Investing_Cash_Flow_YE2023 ': float(row[186]), #'เงินสดสุทธิจากกิจกรรมลงทุน งบปี 2566']),
                            'Investing_Cash_Flow_Q12023 ': float(row[187]), #'เงินสดสุทธิจากกิจกรรมลงทุน ไตรมาส 1/2566']),
                            'Investing_Cash_Flow_Q12024 ': float(row[188]), #'เงินสดสุทธิจากกิจกรรมลงทุน ไตรมาส 1/2567']),
                            'Financing_Cash_Flow_YE2021 ': float(row[189]), #'เงินสดสุทธิจากกิจกรรมจัดหาเงิน งบปี 2564']),
                            'Financing_Cash_Flow_YE2022 ': float(row[190]), #'เงินสดสุทธิจากกิจกรรมจัดหาเงิน งบปี 2565']),
                            'Financing_Cash_Flow_YE2023 ': float(row[191]), #'เงินสดสุทธิจากกิจกรรมจัดหาเงิน งบปี 2566']),
                            'Financing_Cash_Flow_Q12023 ': float(row[192]), #'เงินสดสุทธิจากกิจกรรมจัดหาเงิน ไตรมาส 1/2566']),
                            'Financing_Cash_Flow_Q12024 ': float(row[193]), #'เงินสดสุทธิจากกิจกรรมจัดหาเงิน ไตรมาส 1/2567']),
                            'Net_Cash_Flow_YE2021 ': float(row[194]), #'เงินสดสุทธิ งบปี 2564']),
                            'Net_Cash_Flow_YE2022 ': float(row[195]), #'เงินสดสุทธิ งบปี 2565']),
                            'Net_Cash_Flow_YE2023 ': float(row[196]), #'เงินสดสุทธิ งบปี 2566']),
                            'Net_Cash_Flow_Q12023 ': float(row[197]), #'เงินสดสุทธิ ไตรมาส 1/2566']),
                            'Net_Cash_Flow_Q12024 ': float(row[198]), #'เงินสดสุทธิ ไตรมาส 1/2567']),
                            'Current_Ratio_YE2022 ': float(row[199]), #'อัตราส่วนสภาพคล่อง (เท่า) งบปี 2565']),
                            'Current_Ratio_YE2023 ': float(row[200]), #'อัตราส่วนสภาพคล่อง (เท่า) งบปี 2566']),
                            'Current_Ratio_Q12023 ': float(row[201]), #'อัตราส่วนสภาพคล่อง (เท่า) ไตรมาส 1/2566']),
                            'Current_Ratio_Q12024 ': float(row[202]), #'อัตราส่วนสภาพคล่อง (เท่า) ไตรมาส 1/2567']),
                            'ROE_YE2022 ': float(row[203]), #'อัตราผลตอบแทนผู้ถือหุ้น (%) งบปี 2565']),
                            'ROE_YE2023 ': float(row[204]), #'อัตราผลตอบแทนผู้ถือหุ้น (%) งบปี 2566']),
                            'ROE_Q12023 ': float(row[205]), #'อัตราผลตอบแทนผู้ถือหุ้น (%) ไตรมาส 1/2566']),
                            'ROE_Q12024 ': float(row[206]), #'อัตราผลตอบแทนผู้ถือหุ้น (%) ไตรมาส 1/2567']),
                            'ROA_YE2022 ': float(row[207]), #'อัตราผลตอบแทนจากสินทรัพย์ (%) งบปี 2565']),
                            'ROA_YE2023 ': float(row[208]), #'อัตราผลตอบแทนจากสินทรัพย์ (%) งบปี 2566']),
                            'ROA_Q12023 ': float(row[209]), #'อัตราผลตอบแทนจากสินทรัพย์ (%) ไตรมาส 1/2566']),
                            'ROA_Q12024 ': float(row[210]), #'อัตราผลตอบแทนจากสินทรัพย์ (%) ไตรมาส 1/2567']),
                            'D_E_YE2022 ': float(row[211]), #'อัตราส่วนหนี้สินต่อส่วนของผู้ถือหุ้น (เท่า) งบปี 2565']),
                            'D_E_YE2023 ': float(row[212]), #'อัตราส่วนหนี้สินต่อส่วนของผู้ถือหุ้น (เท่า) งบปี 2566']),
                            'D_E_Q12023 ': float(row[213]), #'อัตราส่วนหนี้สินต่อส่วนของผู้ถือหุ้น (เท่า) ไตรมาส 1/2566']),
                            'D_E_Q12024 ': float(row[214]), #'อัตราส่วนหนี้สินต่อส่วนของผู้ถือหุ้น (เท่า) ไตรมาส 1/2567']),
                            'Total_Assets_Turnover_YE2022 ': float(row[215]), #'อัตราส่วนหมุนเวียนทรัพย์สิน (เท่า) งบปี 2565']),
                            'Total_Assets_Turnover_YE2023 ': float(row[216]), #'อัตราส่วนหมุนเวียนทรัพย์สิน (เท่า) งบปี 2566']),
                            'Total_Assets_Turnover_Q12023 ': float(row[217]), #'อัตราส่วนหมุนเวียนทรัพย์สิน (เท่า) ไตรมาส 1/2566']),
                            'Total_Assets_Turnover_Q12024 ': float(row[218]), #'อัตราส่วนหมุนเวียนทรัพย์สิน (เท่า) ไตรมาส 1/2567']),
                            'Gross_Profit_Margin_YE2022 ': float(row[219]), #'อัตรากำไรขั้นต้น (%) งบปี 2565']),
                            'Gross_Profit_Margin_YE2023 ': float(row[220]), #'อัตรากำไรขั้นต้น (%) งบปี 2566']),
                            'Gross_Profit_Margin_Q12023 ': float(row[221]), #'อัตรากำไรขั้นต้น (%) ไตรมาส 1/2566']),
                            'Gross_Profit_Margin_Q12024 ': float(row[222]), #'อัตรากำไรขั้นต้น (%) ไตรมาส 1/2567']),
                            'EBIT_Margin_YE2022 ': float(row[223]), #'EBIT Margin (%) งบปี 2565']),
                            'EBIT_Margin_YE2023 ': float(row[224]), #'EBIT Margin (%) งบปี 2566']),
                            'EBIT_Margin_Q12023 ': float(row[225]), #'EBIT Margin (%) ไตรมาส 1/2566']),
                            'EBIT_Margin_Q12024 ': float(row[226]), #'EBIT Margin (%) ไตรมาส 1/2567']),
                            'Net_Profit_Margin_YE2022 ': float(row[227]), #'อัตรากำไรสุทธิ (%) งบปี 2565']),
                            'Net_Profit_Margin_YE2023 ': float(row[228]), #'อัตรากำไรสุทธิ (%) งบปี 2566']),
                            'Net_Profit_Margin_Q12023 ': float(row[229]), #'อัตรากำไรสุทธิ (%) ไตรมาส 1/2566']),
                            'Net_Profit_Margin_Q12024 ': float(row[230]), #'อัตรากำไรสุทธิ (%) ไตรมาส 1/2567']),
                            'Sales_Growth_YE2022 ': float(row[231]), #'อัตราการเปลี่ยนแปลงยอดขาย งบปี 2565']),
                            'Sales_Growth_YE2023 ': float(row[232]), #'อัตราการเปลี่ยนแปลงยอดขาย งบปี 2566']),
                            'Sales_Growth_Q12023 ': float(row[233]), #'อัตราการเปลี่ยนแปลงยอดขาย ไตรมาส 1/2566']),
                            'Sales_Growth_Q12024 ': float(row[234]), #'อัตราการเปลี่ยนแปลงยอดขาย ไตรมาส 1/2567']),
                            'COGs_Growth_YE2022 ': float(row[235]), #'อัตราการเปลี่ยนแปลงต้นทุนขาย งบปี 2565']),
                            'COGs_Growth_YE2023 ': float(row[236]), #'อัตราการเปลี่ยนแปลงต้นทุนขาย งบปี 2566']),
                            'COGs_Growth_Q12023 ': float(row[237]), #'อัตราการเปลี่ยนแปลงต้นทุนขาย ไตรมาส 1/2566']),
                            'COGs_Growth_Q12024 ': float(row[238]), #'อัตราการเปลี่ยนแปลงต้นทุนขาย ไตรมาส 1/2567']),
                            'Total_Revenue_Growth_YE2022 ': float(row[239]), #'อัตราการเปลี่ยนแปลงรายได้รวม งบปี 2565']),
                            'Total_Revenue_Growth_YE2023 ': float(row[240]), #'อัตราการเปลี่ยนแปลงรายได้รวม งบปี 2566']),
                            'Total_Revenue_Growth_Q12023 ': float(row[241]), #'อัตราการเปลี่ยนแปลงรายได้รวม ไตรมาส 1/2566']),
                            'Total_Revenue_Growth_Q12024 ': float(row[242]), #'อัตราการเปลี่ยนแปลงรายได้รวม ไตรมาส 1/2567']),
                            'Total_Expense_Growth_YE2022 ': float(row[243]), #'อัตราการเปลี่ยนแปลงค่าใช้จ่ายรวม งบปี 2565']),
                            'Total_Expense_Growth_YE2023 ': float(row[244]), #'อัตราการเปลี่ยนแปลงค่าใช้จ่ายรวม งบปี 2566']),
                            'Total_Expense_Growth_Q12023 ': float(row[245]), #'อัตราการเปลี่ยนแปลงค่าใช้จ่ายรวม ไตรมาส 1/2566']),
                            'Total_Expense_Growth_Q12024 ': float(row[246]), #'อัตราการเปลี่ยนแปลงค่าใช้จ่ายรวม ไตรมาส 1/2567']),
                            'Net_Profit_Growth_YE2022 ': float(row[247]), #'อัตราการเปลี่ยนแปลงกำไรสุทธิ งบปี 2565']),
                            'Net_Profit_Growth_YE2023 ': float(row[248]), #'อัตราการเปลี่ยนแปลงกำไรสุทธิ งบปี 2566']),
                            'Net_Profit_Growth_Q12023 ': float(row[249]), #'อัตราการเปลี่ยนแปลงกำไรสุทธิ ไตรมาส 1/2566']),
                            'Net_Profit_Growth_Q12024 ': float(row[250]), #'อัตราการเปลี่ยนแปลงกำไรสุทธิ ไตรมาส 1/2567']),
                            'A_R_Turnover_Times_YE2022 ': float(row[251]), #'อัตราส่วนหมุนเวียนลูกหนี้การค้า (เท่า) งบปี 2565']),
                            'A_R_Turnover_Times_YE2023 ': float(row[252]), #'อัตราส่วนหมุนเวียนลูกหนี้การค้า (เท่า) งบปี 2566']),
                            'A_R_Turnover_Times_Q12023 ': float(row[253]), #'อัตราส่วนหมุนเวียนลูกหนี้การค้า (เท่า) ไตรมาส 1/2566']),
                            'A_R_Turnover_Times_Q12024 ': float(row[254]), #'อัตราส่วนหมุนเวียนลูกหนี้การค้า (เท่า) ไตรมาส 1/2567']),
                            'Avg_Collection_Period_Days_YE2022 ': float(row[255]), #'ระยะเวลาเก็บหนี้เฉลี่ย (วัน) งบปี 2565']),
                            'Avg_Collection_Period_Days_YE2023 ': float(row[256]), #'ระยะเวลาเก็บหนี้เฉลี่ย (วัน) งบปี 2566']),
                            'Avg_Collection_Period_Days_Q12023 ': float(row[257]), #'ระยะเวลาเก็บหนี้เฉลี่ย (วัน) ไตรมาส 1/2566']),
                            'Avg_Collection_Period_Days_Q12024 ': float(row[258]), #'ระยะเวลาเก็บหนี้เฉลี่ย (วัน) ไตรมาส 1/2567']),
                            'Inventory_Turnover_Times_YE2022 ': float(row[259]), #'อัตราส่วนหมุนเวียนสินค้าคงเหลือ (เท่า) งบปี 2565']),
                            'Inventory_Turnover_Times_YE2023 ': float(row[260]), #'อัตราส่วนหมุนเวียนสินค้าคงเหลือ (เท่า) งบปี 2566']),
                            'Inventory_Turnover_Times_Q12023 ': float(row[261]), #'อัตราส่วนหมุนเวียนสินค้าคงเหลือ (เท่า) ไตรมาส 1/2566']),
                            'Inventory_Turnover_Times_Q12024 ': float(row[262]), #'อัตราส่วนหมุนเวียนสินค้าคงเหลือ (เท่า) ไตรมาส 1/2567']),
                            'Avg_Inventory_Period_Days_YE2022 ': float(row[263]), #'ระยะเวลาขายสินค้าเฉลี่ย (วัน) งบปี 2565']),
                            'Avg_Inventory_Period_Days_YE2023 ': float(row[264]), #'ระยะเวลาขายสินค้าเฉลี่ย (วัน) งบปี 2566']),
                            'Avg_Inventory_Period_Days_Q12023 ': float(row[265]), #'ระยะเวลาขายสินค้าเฉลี่ย (วัน) ไตรมาส 1/2566']),
                            'Avg_Inventory_Period_Days_Q12024 ': float(row[266]), #'ระยะเวลาขายสินค้าเฉลี่ย (วัน) ไตรมาส 1/2567']),
                            'A_P_Turnover_Times_YE2022 ': float(row[267]), #'อัตราส่วนหมุนเวียนเจ้าหนี้การค้า (เท่า) งบปี 2565']),
                            'A_P_Turnover_Times_YE2023 ': float(row[268]), #'อัตราส่วนหมุนเวียนเจ้าหนี้การค้า (เท่า) งบปี 2566']),
                            'A_P_Turnover_Times_Q12023 ': float(row[269]), #'อัตราส่วนหมุนเวียนเจ้าหนี้การค้า (เท่า) ไตรมาส 1/2566']),
                            'A_P_Turnover_Times_Q12024 ': float(row[270]), #'อัตราส่วนหมุนเวียนเจ้าหนี้การค้า (เท่า) ไตรมาส 1/2567']),
                            'Avg_Payment_Period_Days_YE2022 ': float(row[271]), #'ระยะเวลาชำระหนี้เจ้าหนี้การค้า (วัน) งบปี 2565']),
                            'Avg_Payment_Period_Days_YE2023 ': float(row[272]), #'ระยะเวลาชำระหนี้เจ้าหนี้การค้า (วัน) งบปี 2566']),
                            'Avg_Payment_Period_Days_Q12023 ': float(row[273]), #'ระยะเวลาชำระหนี้เจ้าหนี้การค้า (วัน) ไตรมาส 1/2566']),
                            'Avg_Payment_Period_Days_Q12024 ': float(row[274]), #'ระยะเวลาชำระหนี้เจ้าหนี้การค้า (วัน) ไตรมาส 1/2567']),
                            'Cash_Cycle_Days_YE2022 ': float(row[275]), #'วงจรเงินสด (วัน) งบปี 2565']),
                            'Cash_Cycle_Days_YE2023 ': float(row[276]), #'วงจรเงินสด (วัน) งบปี 2566']),
                            'Cash_Cycle_Days_Q12023 ': float(row[277]), #'วงจรเงินสด (วัน) ไตรมาส 1/2566']),
                            'Cash_Cycle_Days_Q12024 ': float(row[278]), #'วงจรเงินสด (วัน) ไตรมาส 1/2567']),
                        }
                    )

            except FieldError as e:
                print("FieldError:", e)
                return render(request, 'stocks/upload_csv.html', {
                    'form': forms,
                    'error': f'FieldError: {e}',
                })
            except ValueError as e:
                print("ValueError:", e)
                return render(request, 'stocks/upload_csv.html', {
                    'form': forms,
                    'error': f'ValueError: {e}',
                })
            except Exception as e:
                    return render(request, 'stocks/upload_csv.html', {
                        'form': forms,
                        'error': f'Unexpected error: {e}',
                    })

            return redirect('stock_list')  # Adjust this redirect to your actual view name
    else:
        forms = CSVUploadForm()
    return render(request, 'stocks/upload_csv.html', {'form': forms})